test/performance/benchmarks/func-invocation-ego/run/single-fun-enclave-no-samba/1250.log
2025/07/05 14:56:50 Function mode: 
{"level":"info","ts":1751727410.322919,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/07/05 14:56:50 Starting func invocation probe for target: appender-ego
2025/07/05 14:56:50 Using rate: 1250
Requests      [total, rate, throughput]         375000, 1250.00, 1136.32
Duration      [total, attack, wait]             5m30s, 5m0s, 30s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.234ms, 59.052ms, 33.913ms, 120.73ms, 187.576ms, 342.739ms, 30.001s
Bytes In      [total, mean]                     14249430, 38.00
Bytes Out     [total, mean]                     8624655, 23.00
2025/07/05 15:02:20 Shutting down InfluxReporter
Success       [ratio]                           100.00%
Status Codes  [code:count]                      0:15  200:374985  
Error Set:
Post "http://appender-ego.default.svc.cluster.local": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
2025/07/05 15:02:20 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 187.575832ms