test/performance/benchmarks/func-invocation-ego/run/single-fun-enclave-no-samba/1500.log
2025/07/05 15:02:41 Function mode: 
{"level":"info","ts":1751727761.244395,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/07/05 15:02:41 Starting func invocation probe for target: appender-ego
2025/07/05 15:02:41 Using rate: 1500
Requests      [total, rate, throughput]         283250, 935.19, 488.64
Duration      [total, attack, wait]             5m31s, 5m3s, 28.2s
Latencies     [min, mean, 50, 90, 95, 99, max]  362.745µs, 27.628s, 19.102s, 1m10s, 1m23s, 1m53s, 3m11s
Bytes In      [total, mean]                     8384642, 29.60
2025/07/05 15:08:12 Shutting down InfluxReporter
Bytes Out     [total, mean]                     4381868, 15.47
Success       [ratio]                           57.11%
Status Codes  [code:count]                      0:92734  200:161777  502:3246  503:25493  
Error Set:
503 Service Unavailable
502 Bad Gateway
Post "http://appender-ego.default.svc.cluster.local": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://appender-ego.default.svc.cluster.local": EOF
Post "http://appender-ego.default.svc.cluster.local": dial tcp 0.0.0.0:0->10.100.28.161:80: bind: address already in use
Post "http://appender-ego.default.svc.cluster.local": dial tcp 0.0.0.0:0->10.100.28.161:80: bind: address already in use (Client.Timeout exceeded while awaiting headers)
2025/07/05 15:08:12 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 1m23.158173758s