test/performance/benchmarks/func-invocation-ego/run/single-fun-enclave-no-samba/250.log
2025/07/05 14:34:56 Function mode: 
{"level":"info","ts":1751726096.5065773,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/07/05 14:34:56 Starting func invocation probe for target: appender-ego
2025/07/05 14:34:56 Using rate: 250
Requests      [total, rate, throughput]         75000, 250.00, 250.00
Duration      [total, attack, wait]             5m0s, 5m0s, 4.507ms
Latencies     [min, mean, 50, 90, 95, 99, max]  1.005ms, 4.602ms, 4.672ms, 5.015ms, 5.095ms, 5.738ms, 74.804ms
Bytes In      [total, mean]                     2850000, 38.00
Bytes Out     [total, mean]                     1725000, 23.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:75000  
Error Set:
2025/07/05 14:39:56 Shutting down InfluxReporter
2025/07/05 14:39:56 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 5.095427ms