test/performance/benchmarks/func-invocation-ego/run/single-fun-enclave-no-samba/500.log
2025/07/05 14:40:17 Function mode: 
{"level":"info","ts":1751726417.1603262,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/07/05 14:40:17 Starting func invocation probe for target: appender-ego
2025/07/05 14:40:17 Using rate: 500
2025/07/05 14:45:17 Shutting down InfluxReporter
Requests      [total, rate, throughput]         150000, 500.00, 500.00
Duration      [total, attack, wait]             5m0s, 5m0s, 4.405ms
Latencies     [min, mean, 50, 90, 95, 99, max]  840.316µs, 4.258ms, 4.294ms, 4.831ms, 4.988ms, 5.79ms, 120.254ms
Bytes In      [total, mean]                     5700000, 38.00
Bytes Out     [total, mean]                     3450000, 23.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:150000  
Error Set:
2025/07/05 14:45:17 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 4.988297ms